Revit 2027 API
FabricTagComponentReference Enumeration
 How FabricSheet tag text will be aligned to the FabricSheet symbol.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum FabricTagComponentReference
Public Enumeration FabricTagComponentReference
public enum class FabricTagComponentReference
type FabricTagComponentReference
Members
Member name | Value | Description
Diagonal | 2 |  Tag and Leader will reference the symbol diagonal.
Intersection | 3 |  Tag and Leader will reference the intersection of the major and minor axes.
MajorAxis | 0 |  Tag and Leader will reference the symbol major direction axis.
MinorAxis | 1 |  Tag and Leader will reference the symbol minor direction axis.
See Also
Reference
Autodesk.Revit.DB.Structure Namespace